Repository: Anan8/MachineLearning
Catalog: tools/language/*.UTF-8/LC_MESSAGES/*.po
Languages: de_de

source: matrix rows and label size are not equal
de_de: Matrixzeilenanzhal und Labelanzahl nicht gleich

source: prototype size must be greater than zero
de_de: Prototypdimension muss größer Null sein

source: number of prototypes must be greater than zero
de_de: Prototypanzahl muss größer Null sein

source: iterations must be greater than zero
de_de: Iterationen müssen größer Null sein

source: data and prototype dimension are not equal
de_de: Daten- und Prototypdimension nicht identisch

source: number of datapoints are less than prototypes
de_de: Anzahl Datenpunkte weniger als Anzahl Prototypen

source: lambda must be greater than zero
de_de: Lambda muss größer Null sein

source: method is not implementated in this class
de_de: Methode ist nicht in der Klasse implementiert

source: matrix must be square
de_de: Matrix muss quadratisch sein

source: eta must be greater than zero
de_de: Eta muss größer Null sein

source: dimension must be greater than zero
de_de: Dimension muss größer Null sein

source: data points are less than target dimension
de_de: Datenpunkte sind weniger als Zieldimensionen

source: datapoint dimension are less than target dimension
de_de: Datenpunkt Dimension ist kleiner als Zieldimension

source: project option is unkown
de_de: Projektionsoption unbekannt

source: steps must be greater than zero
de_de: Schritte müssen größer Null sein

source: sammon mapping may not converge
de_de: Sammon-Mapping ist nicht konvergiert

source: data matrix has only zero entries
de_de: Datenmatrix hat nur Nulleinträge

source: centering can not be used with MPI
de_de: Centering kann mit MPI nicht verwendet werden

source: MPI project option is unkown
de_de: MPI Projektionsioption nicht bekannt

source: target dimension must be less than unique data classes
de_de: Zieldimension muss kleiner sein als eindeutige Klassenanzahl

source: vector size must be greater than zero
de_de: Vektordimension muss größer Null sein

source: string size must be greater than zero
de_de: Stringlänge muss größer Null sein

source: file can not be opened
de_de: Datei konnte nicht geöffnet werden

source: function need not be empty
de_de: Funktion darf nicht leer sein

source: arithmetic expression could not be parsed
de_de: arithmetischer Ausdruck konnte nicht verarbeitet werden

source: error function need not be empty
de_de: Errorfunktion darf nicht leer sein

source: variable name for the function need not be empty
de_de: Variablenname für die Funktion darf nicht leer sein

source: separators need not be empty
de_de: Separatoren dürfen nicht leer sein

source: variable for optimization is not found in the expression symbol table
de_de: Variable zur Optimierung ist nicht in der Ausdrucksymboltabelle

source: only one variable for the data must be added
de_de: nur eine Variable darf für die Daten hinzugefügt werden

source: static variable is not in the symbol table or is an optimazation variable
de_de: statische Variable ist nicht in der Symboltabelle oder ist keine Variablen, die optimiert wird

source: stepsize must be greater than zero
de_de: Schrittgröße muss größer Null sein

source: there are unsed variables
de_de: es existieren unbenutzte Variablen

source: population size must be greater than two
de_de: Populationsgröße muss größer Zwei sein

source: elite size must be greater than one
de_de: Eliteanzahl muss größer Eins sein

source: elite size must be smaller than population size
de_de: Eliteanzahl muss kleiner als Populationsgröße sein

source: element sizes are not equal
de_de: Elementanzahl nicht identisch

source: cuts must be greater than zero
de_de: Schnitte muss größer Null sein

source: size number need not to be zero
de_de: Anzahl darf nicht Null sein

source: can not allocate memory
de_de: Speicher kann nicht allokiert werden

source: index out of range
de_de: Index außerhalb des Definitionsbereiches

source: number must be greater than zero
de_de: Anzahl muss größer Null sein

source: fitness values are all zero
de_de: alle Fitnesswerte sind Null

source: pointer to object is empty
de_de: Zeiger auf das Objekt ist leer

source: pointer to object is not empty
de_de: Zeiger auf das Objekt ist nicht leer

source: call is not within a thread-safe content
de_de: Aufruf ist nicht in einem thread-sicheren Bereich

source: release thread can not be determine correctly
de_de: Threadrelease kann nicht richtig beendet werden

source: pointer field can not detected
de_de: Zeigerfeld konnte nicht ermittelt werden

source: number of approximate data must be greater than zero
de_de: Anzahl der approximierten Daten muss größer Null sein

source: knn must be greater than zero
de_de: kNN muss größer Null sein

source: knn is greater than datapoints
de_de: kNN ist größer als Datenpunkte

source: both matrices have not the same size
de_de: beide Matrizen haben nicht die gleiche Größe

source: number of rows / columns of the matrix must have the same dimension like the initialisation vector
de_de: Anzahl der Zeilen / Spalten der Matrix müssen die selbe Dimension haben, wie der Initialisierungsvektor

source: log state is unkown
de_de: Logging Status unbekannt

source: row size must be greater than zero
de_de: Zeilenanzahl muss größer Null sein

source: column size must be greater than zero
de_de: Spaltenanzahl muss größer Null sein

source: distribution is not kwon
de_de: Verteilung unbekannt

source: vector dimension must be greater than zero
de_de: Vektordimension muss größer Null sein

source: separator can not be empty
de_de: Separator darf nicht leer sein

source: can not separate size
de_de: kann Größe nicht separieren

source: dataset must be two-dimensional
de_de: Daten müssen zweidimensional sein

source: dataset must be a simple datatype
de_de: Daten müssen einen einfachen Datentyp besitzen

source: dimension need not be zero
de_de: Dimension darf nicht Null sein

source: dataset must be one-dimensional
de_de: Daten müssen eindimensional sein

source: element is not a single value
de_de: Element ist kein einfacher Wert

source: block size can not seperated by the string length
de_de: Blockgröße kann nicht von der Stringlänge separiert werden

source: can not write empty data
de_de: leere Daten können nicht geschrieben werden

source: it is at least one dimension requires
de_de: es ist mindestens eine Dimension nötig

source: empty path is forbidden
de_de: leerer Pfad ist verboten

source: can not create path structure
de_de: Pfadstruktur konnte nicht erzeugt werden

source: number of dimensions must be greater than one
de_de: Anzahl der Dimensionen muss größer Eins sein

source: minimum need not be zero
de_de: Minimum darf nicht Null sein

source: maximum need not be zero
de_de: Maximum darf nicht Null sein

source: minimal value is greater than maximal value
de_de: Minimumwert ist größer als Maximumwert

source: minimum and maximum must be greater than zero
de_de: Minimum und Maximum müssen größer Null sein

source: dimension must be smaller than saved dimension
de_de: Dimension muss kleiner sein, als gespeicherte Dimension

source: sampling value must be greater than zero
de_de: Sampling muss größer Null sein

source: random value must be between [0,1]
de_de: Zufallswert muss zwischen [0,1] liegen

source: stopwordlist can not be empty
de_de: Stopwortliste kann nicht leer sein

source: ranges must be between [0,1]
de_de: Bereich muss zwischen [0,1] liegen

source: no words within the map
de_de: keine Worte in der Map

source: parameter is not a language code
de_de: Parameter ist kein Sprachencode

source: language is not known
de_de: Sprache ist unbekannt

source: can not connect to news server
de_de: Verbindung zu Newsserver nicht möglich

source: error while reading socket data
de_de: Fehler während Socketzugriff

source: no such group
de_de: keine Gruppe gefunden

source: no newsgroup has been selected
de_de: keine Newsgroup ausgewählt

source: no article has been selected
de_de: kein Artikel ausgewählt

source: no next article found
de_de: kein Artikel gefunden

source: no previous article found
de_de: keinen Vorgängerartikel gefunden

source: no such article number in this group
de_de: keine Artikelanzahl in der Gruppe

source: no such article found
de_de: kein Artikel gefunden

source: article not wanted - do not send
de_de: Artikel nicht gewollt - nicht gesendet

source: transfer failed - try again later
de_de: Übertragung fehlerhaft - später versuchen

source: article rejected - do not try again
de_de: Artikel abgelehnt - nicht wiederholen

source: posting not allowed
de_de: Posting nicht erlaubt

source: posting failed
de_de: Posting ist fehlgeschlagen

source: command not recognized
de_de: Kommando nicht bekannt

source: command syntax error
de_de: Kommandosyntax Fehler

source: access restriction or permission denied
de_de: Zugriffsbeschränkung oder Zugriff verboten

source: service is not available
de_de: Service nicht erreichbar

source: can not connect to twitter search server
de_de: konnte nicht zu Twitter-Such-Server verbinden

source: can not connect to twitter api server
de_de: konnte nicht zu Twitter-API-Server verbinden

source: HTTP agent name need not be empty
de_de: HTTP Agent darf nicht leer sein

source: search query need not be empty
de_de: Suchanfrage darf nicht leer sein

source: refresh query need not be empty
de_de: Refreshanfrage darf nicht leer sein

source: JSON data can not be parsed
de_de: JSON Daten konnten nicht verarbeitet werden

source: no data received
de_de: keine Daten empfangen

source: no result data is found
de_de: keine Rückgabedaten gefunden

source: invalid response
de_de: ungültige Antwort

source: data can not be received
de_de: Daten konnten nicht empfangen werden

source: Non-Authoritative Information
de_de: keine Authentifizierungsinformationen

source: No Content
de_de: kein Inhalt

source: Reset Content
de_de: Content resettet

source: Partial Content
de_de: Teilinhalt

source: Multiple Choices
de_de: unterschiedliche Auswahlmöglichkeiten

source: Moved Permanently
de_de: dauerhaft verschoben

source: Moved Temporarily
de_de: temporär verschoben

source: See Other
de_de: see andere

source: Not Modified
de_de: nicht modifizert

source: Use Proxy
de_de: Proxy benutzen

source: Temporary Redirect
de_de: temporäre Umleitung

source: Bad Request
de_de: ungültige Anfrage

source: Unauthorized
de_de: nicht authorisiert

source: Payment Required
de_de: Zahlung notwendig

source: Forbidden
de_de: Verboten

source: Not Found
de_de: nicht gefunden

source: Method Not Allowed
de_de: Methode nicht erlaubt

source: Not Acceptable
de_de: nicht akzeptiert

source: Proxy Authentication Required
de_de: Proxyauthentifizierung notwendig

source: Request Time-out
de_de: Anfragezeitüberschreitung

source: Conflict
de_de: Konflikt

source: Gone
de_de: nicht vorhanden

source: Length Required
de_de: Länge notwendig

source: Precondition Failed
de_de: Voraussetzung nicht erfolgt

source: Request Entity Too Large
de_de: Requesteintrag ist zu lange

source: Request-URI Too Large
de_de: Request-URL zu lang

source: Unsupported Media Type
de_de: ungültiger Medientyp

source: Requested range not satisfiable
de_de: angefragter Bereich nicht erfüllbar

source: Expectation Failed
de_de: Erwartung nicht erfüllt

source: Internal Server Error
de_de: interner Serverfehler

source: Not Implemented
de_de: nicht implementiert

source: Bad Gateway
de_de: ungültiger Gateway

source: Service Unavailable
de_de: Service nicht erreichbar

source: Gateway Time-out
de_de: Gateway Zeitüberschreibung

source: HTTP Version not supported
de_de: HTTP Version wird nicht unterstützt

source: option value is unkown
de_de: Optionswert nicht bekannt

source: not a valid date
de_de: kein valides Datum

source: results per page must be in the range [1,100]
de_de: Rückgaben pro Seite müssen innerhalb des Bereich [1,100] sein

source: maximum results are reached
de_de: maximale Anzahl erreicht

source: at
de_de: um

source: to
de_de: von

source: language has no option values
de_de: Sprache hat keine Optionen

source: can not find information within the http header
de_de: konnte Informationen nicht im HTTP Header finden

source: can not find wikipedia document within the URL
de_de: konnte Wikipedia Dokument nicht anhand der URL ermitteln

source: no article is loaded
de_de: kein Artikel geladen

source: XML data can not be parsed
de_de: XML Daten konnten nicht verarbeitet werden

source: can not detect namespace
de_de: Konnte Namespace nicht ermitteln

source: can not connect to wikipedia server
de_de: Konnte Wikiepdia Server nicht erreichen
