Repository: Anan8/MachineLearning
Catalog: tools/language/*.UTF-8/LC_MESSAGES/language.po
Languages: de_de

source: method is not implementated in the base class
de_de: Methode ist nicht implementiert, da sie Teil einer Basisklasse ist

source: matrix rows and label size are not equal
de_de: Matrixzeilen und Labelanzahl sind nicht identisch

source: prototype size must be greater than zero
de_de: Prototypdimension musst größer Null sein

source: number of prototypes must be greater than zero
de_de: Anzahl der Prototypen muss größer Null sein

source: iterations must be greater than zero
de_de: Iterationen müssen größer Null sein

source: data and prototype dimension are not equal
de_de: Daten- und Prototypdimension sind nicht identisch

source: number of datapoints are less than prototypes
de_de: Anzahl der Datenpunkte ist weniger als Anzahl der Prototypen

source: lambda must be greater than zero
de_de: Lambda muss größer Null sein

source: matrix are not symmetric
de_de: Matrix ist nicht symmetrisch

source: eta must be greater than zero
de_de: Eta muss größer Null sein

source: dimension must be greater than zero
de_de: Dimension muss größer Null sein

source: data points are less than target dimension
de_de: Datenpunktdimension ist kleiner als Dimension der Zielprojektion

source: datapoint dimension are less than target dimension
de_de: Datenpunktdimension ist kleiner als Dimension der Zielprojektion

source: target dimension must be less than unique data classes
de_de: Zieldimension musst kleiner sein als Anzahl der eindeutigen Klassen

source: vector size must be greater than zero
de_de: Vektor Puffer muss größer Null sein

source: string size must be greater than zero
de_de: Zeilenanzahl muss größer Null sein

source: file can not be opened
de_de: Datei konnte nicht geöffnet werden

source: function need not be empty
de_de: Funktion darf nicht leer sein

source: arithmetic expression could not be parsed
de_de: Arithmetischer Ausdruckt konnte nicht geparst werden

source: error function need not be empty
de_de: Fehlerfunktion darf nicht leer sein

source: variable name for the function need not be empty
de_de: Variablenname für die Funktion darf nicht leer sein

source: separators need not be empty
de_de: Separator darf nicht leer sein

source: variable for optimization is not found in the expression symbol table
de_de: Variable zur Optimierung ist nicht im symbolischen Ausdruck enthalten

source: knn must be greater than zero
de_de: KNN muss größer Null sein

source: knn is greater than datapoints
de_de: KNN ist größer als Anzahl der Datenpunkte

source: both matrices have not the same size
de_de: beide Matrizen haben nicht die gleiche Größe

source: row size must be greater than zero
de_de: Zeilenanzahl muss größer Null sein

source: column size must be greater than zero
de_de: Spaltenanzahl muss größer Null sein

source: distribution is not kwon
de_de: Verteilung ist nicht bekannt

source: length must be greater than zero
de_de: Länge muss größer Null sein

source: vector dimension must be greater than zero
de_de: Vektordimension muss größer Null sein

source: can not separate size
de_de: Größe konnte nicht ermittelt werden

source: vector reserve must be greater than zero
de_de: Vektor Puffer muss größer Null sein

source: dataset must be one-dimensional
de_de: Datensatz muss ein-dimensional sein

source: dataset must be a simple datatype
de_de: Datensatz muss ein Simpledatentyp sein

source: empty path is forbidden
de_de: Eine leere Pfadangabe ist verboten

source: dataset must be two-dimensional
de_de: Datensatz muss zwei-dimensional sein
